- pandas : used for data base reading writting modify the data 
- numpy: used for numerical or math operations
- matplotlib : used for plotting
- seaborn : used for plotting


-- huthhgryhurut

In [ ]:
==============================EDA===================================
1) pandas         : Data frame operations
2) numpy          : math operations
3) matplotlib     : plotting or graphs
4) seaborn        : plotting or graphs
5) plotly         : plotting or graphs
6) bokhe          : plotting or graphs
    
====================== Machine learning ==========================
7) sickit-learn(sklean)   : For ALL ML algorithms
8) stats                  : some statistical operations
    

====================== Deep learning ================================
9) Tensorflow       : Deep learning models (Google)
10) keras           : Deep learning models tensorflow as backend
11) pytorch         : Deep learning models (Meta)
12) opencv          : Image and Video opeartions
13) pillow          : Image operations
    
    
=================== Object Detection models(Transfer learning)==================
14) Mobilenet        : Deep learning packages
15) VGGnet           : Deep learning packages
16) Resnet           : Deep learning packages
17) Inceptionv3      : Deep learning packages
18) YOLO             : Deep learning packages
    
    
====================== Natural Language process ===============================
19) NLTK             : Natural Langauge Tool Kit
20) SpCy             : Alternative to NLTK
21) Wordcloud        : Text representation
    
======================= NLP word Embedding Models ==============================
22) Word2Vec         : Google
23) GloVe            : Stanford
24) Fasttext         : Meta(Face book)
    
====================== ALLEN NLP (organization) ===========================
25) NLP applications : Pyspark as Backend
    
    
======================= Optical Character Recognition(OCR) ===============
Extract the text from the image
26) Tesseract
27) easyocr

=========================BERT=======================================
BERT: Bi directional Encoded Representations from Transformers
28) Transformers : Hugging face (Google)
    
    
==================== WebScrapping ===========================
29) SQLITE       : Connect the Database using python In [ ]: In [ ]:

30) Selenium
31) Beautiful soup
32) Regex

===================== GenAI and LLM =============================
33) Langchain : To Connect all LLM models
34) GPT : OpenAI
35) Gemini : Google
36) Llama : Meta
37) Grok : XAi
38) BedRock : Amazon
39) Claude AI : Anthropic
=================== Agentic AI==================================
40) Langraph
41) CrewAI
42) Phidata
43) Autogen
==================== API creation==============================
44) Flask
45) FastAPI
46) Gradio
47) Django
===================== WebAppliaction ===========================
48) Streamlit
======================= Model deployment(MLops) ==============================
49) mlflow
50) Kubeflow
========================== Cloud AI =========================================
51) Azure Cognitive services
52) Azure ML Studio
53) GCP vertexAI
54) AWS Sagemaker
=============================== Extra ========================================
55) random
56) time
57) math
58) logging
59) warnings
60) date

## Step-1: Import packages

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## step-2: create dataframe using list

In [4]:
names=['ramesh','suresh','satish']
#pd.dataframe(data,index,columns)
pd.DataFrame(names)

        0
0  ramesh
1  suresh
2  satish

## step-3 add columns

In [7]:
names=['ramesh','suresh','satish']
#pd.dataframe(data,index,columns)
pd.DataFrame(names,columns=['Names'])

    Names
0  ramesh
1  suresh
2  satish

## step -4 : update index

In [3]:
names=['Ramesh','Suresh','Sathish']
# pd.DataFrame(data,index,columns)
pd.DataFrame(names,
             index=['A','B','C'])

         0
A   Ramesh
B   Suresh
C  Sathish

In [3]:
names=['ramesh','suresh','satish']
#pd.dataframe(data,index,columns)
cols=['name']
idx=['A','B','C']

pd.DataFrame(names,
             index=idx,
             columns=cols)

     name
A  ramesh
B  suresh
C  satish

## step-5: creat dataframe multiple columns

In [4]:
names=['Ramesh','Suresh','Sathish']
city=['Hyd','Mumbai','Blr']
data=[names,city]
cols=['name','city']
idx=['A','B','C']
pd.DataFrame(data,
             index=cols,
             columns=idx).T
# .T का मतलब है Transpose (पलटना — rows को columns और columns को rows में बदलना)

      name    city
A   Ramesh     Hyd
B   Suresh  Mumbai
C  Sathish     Blr

In [4]:
names=['Ramesh','Suresh','Sathish']
city=['Hyd','Mumbai','Blr']
data=[names,city]
cols=['name','city']
idx=['A','B','C']
pd.DataFrame(data,
             index=cols,
             columns=idx)

           A       B        C
name  Ramesh  Suresh  Sathish
city     Hyd  Mumbai      Blr

In [8]:
names=['Ramesh','Suresh','Sathish']
city=['Hyd','Mumbai','Blr']
data=[names,city]
cols=['name','city']
idx=['A','B','C']
pd.DataFrame(data,
             index=idx,
             columns=cols)

ValueError: 2 columns passed, passed data had 3 columns

In [8]:
names=['ramesh','suresh','satish']
#pd.dataframe(data,index,columns)
cols=['name','city']
idx=['A','B','C']
city=['hyd','mumbai','blr']
data=zip(names,city)
pd.DataFrame(data,
             index=idx,
             columns=cols)

     name    city
A  ramesh     hyd
B  suresh  mumbai
C  satish     blr

In [10]:
names=['ramesh','suresh','satish']
#pd.dataframe(data,index,columns)
cols=['name','city','age']
idx=['A','B','C']
city=['hyd','mumbai','blr']
data=zip(names,city,age)
age=[20,22,25]
pd.DataFrame(data,
             index=idx,
             columns=cols)

     name    city  age
A  ramesh     hyd   20
B  suresh  mumbai   22
C  satish     blr   25

## step - 6 : howto add data to empty dataframe

In [10]:
l=[]
l.append(20)
l
d={}
d['Names']=['Ramesh','Suresh','Sathish']
print(d)

s=''
s=s+'apple'
s

{'Names': ['Ramesh', 'Suresh', 'Sathish']}

'apple'

In [19]:
m={}
m['money']=[10,20,30,40,50]
m

{'money': [10, 20, 30, 40, 50]}

In [25]:
m={}
m['money']=[10,20,30,40,50]
m['doller']=[1,23,45,64,55]

In [26]:
df=pd.DataFrame(m)
df

   money  doller
0     10       1
1     20      23
2     30      45
3     40      64
4     50      55

In [13]:
df=pd.DataFrame()
df['name']=['ramesh','mohan','mohit']
df['age']=[20,22,25]
df['city']=['hyd','mp','blr']

df

     name  age city
0  ramesh   20  hyd
1   mohan   22   mp
2   mohit   25  blr

In [14]:
df=pd.DataFrame()
df['name']=[10,20]
df

   name
0    10
1    20

## step-7 : create a dataframe using dictionary

In [27]:
df=pd.DataFrame(m)
df     # indirect dictionary

   money  doller
0     10       1
1     20      23
2     30      45
3     40      64
4     50      55

In [30]:
d={'names': ['ramesh','suresh','manish'],
  'age': [20,22,25],
  'city': ['hyd','mp','blr']}
df=pd.DataFrame(d)
df                  # using direct dictionary

    names  age city
0  ramesh   20  hyd
1  suresh   22   mp
2  manish   25  blr

## **step-8 methods**
- shape
- size
- columns
- dtypes
- isnull

In [31]:
df.shape

(3, 3)

In [18]:
df.size

9

In [32]:
df.columns

Index(['names', 'age', 'city'], dtype='object')

In [20]:
df.dtypes

names    object
age       int64
city     object
dtype: object

In [21]:
df.isnull

<bound method DataFrame.isnull of     names  age city
0  ramesh   20  hyd
1  suresh   22   mp
2  manish   25  blr>

In [22]:
df.isnull()#✅ Explanation (हिंदी में):
             # df.isnull() हर cell को check करता है।

            #अगर कोई value missing (null/NaN) है → True देगा।

        # अगर value मौजूद है → False देगा।
df

   names    age   city
0  False  False  False
1  False  False  False
2  False  False  False

In [36]:
d = {'Names': ['Ramesh', None, 'Sathish',None]}
df = pd.DataFrame(d)
print(df.isnull())

   Names
0  False
1   True
2  False
3   True

In [24]:
df.isnull().sum() # column wise null available
    #अगर आप ये भी जानना चाहते हैं कि कितने null values हैं, तो:

names    0
age      0
city     0
dtype: int64

In [37]:
df.isnull().sum()

Names    2
dtype: int64

## step-9 : rename the columns

In [2]:
import pandas as pd
d={'Names':['Ramesh','Suresh','Sathish'],
'Age':[20,22,24],
'City':['Hyd','Mumbai','Blr']}
df=pd.DataFrame(d)
df

     Names  Age    City
0   Ramesh   20     Hyd
1   Suresh   22  Mumbai
2  Sathish   24     Blr

In [25]:
df.columns=['a','b','c']
df                  #if we want rename the all columns

        a   b    c
0  ramesh  20  hyd
1  suresh  22   mp
2  manish  25  blr

In [26]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [3]:
df.index=['A','B','C']
df

     Names  Age    City
A   Ramesh   20     Hyd
B   Suresh   22  Mumbai
C  Sathish   24     Blr

In [28]:
d={'names': ['ramesh','suresh','manish'],
  'age': [20,22,25],
  'city': ['hyd','mp','blr']}
df=pd.DataFrame(d)
df

    names  age city
0  ramesh   20  hyd
1  suresh   22   mp
2  manish   25  blr

In [8]:
# df.rename(mapper,index,column,axis,inplace)
d={'Name':'A','age':'B','city': 'C'}
df.rename(columns=d,inplace=True)
df

         A   B       C
A   Ramesh  20     Hyd
B   Suresh  22  Mumbai
C  Sathish  24     Blr

In [9]:
import pandas as pd

df = pd.DataFrame({
    'Names': ['Amit', 'Sita'],
    'Age': [25, 30],
    'City': ['Delhi', 'Mumbai']
})

d = {'Names':'A', 'Age':'B', 'City':'C'}
df.rename(columns=d, inplace=True)

print(df)

      A   B       C
0  Amit  25   Delhi
1  Sita  30  Mumbai

In [7]:
df

         A   B       C
A   Ramesh  20     Hyd
B   Suresh  22  Mumbai
C  Sathish  24     Blr

In [ ]:
#I want to change my columns

#I provided dictionary of a mapper with new columns

#I want to feed a food you

#I prepared a food

In [10]:
d={'Names':['Ramesh','Suresh','Sathish'],
'Age':[20,22,24],
'City':['Hyd','Mumbai','Blr']}
df=pd.DataFrame(d)
#df.rename(mapper,index,columns,axis,inplace)
a={'Names':'A', 'Age':'B','City':'C'}
df.rename(index=a,inplace=True)
df   #आपने index=a लिखा है, जबकि आप कॉलम के नाम बदलना चाहते हैं। इसलिए कुछ नहीं बदलेगा।

     Names  Age    City
0   Ramesh   20     Hyd
1   Suresh   22  Mumbai
2  Sathish   24     Blr

In [11]:
d={'Names':['Ramesh','Suresh','Sathish'],
'Age':[20,22,24],
'City':['Hyd','Mumbai','Blr']}
df=pd.DataFrame(d)
#df.rename(mapper,index,columns,axis,inplace)
d={0:'A', 1:'B',2:'C'}
df.rename(index=d,inplace=True)
df#आपने index=d लिखा है,-।

     Names  Age    City
A   Ramesh   20     Hyd
B   Suresh   22  Mumbai
C  Sathish   24     Blr

In [ ]:
d={0:'A', 1:'B',2:'C'}
df.rename(index=d,inplace=True)
d={'Names':'A', 'Age':'B','City':'C'}
df.rename(columns=d,inplace=True)
d={'Names':'A', 'Age':'B','City':'C'}

df.rename(d,inplace=True) # my python not unde
# this mapper belongs to index or column
d={'Names':'A', 'Age':'B','City':'C'}
df.rename(columns=d,inplace=True)
d={0:'A', 1:'B',2:'C'}
df.rename(index=d,inplace=True)

In [12]:
d={'Names':['Ramesh','Suresh','Sathish'],
'Age':[20,22,24],
'City':['Hyd','Mumbai','Blr']}
df=pd.DataFrame(d)
df
d={'Names':'A', 'Age':'B','City':'C'}# mapper = d kah sakte same 
df.rename(d,inplace=True)# axis=1 mtlb column, axis=0 → rows
df.rename(d,
           axis=1,
           inplace=True)
df
# this guy used mapper का मतलब है: "columns को d dictionary से बदलो"


# also he told me that it is a column mapper axis=1
# mapper → वह dictionary होती है जो नाम बदलती है।
# axis=1 → इसका मतलब "columns" (क्योंकि axis=1 → columns, axis=0 → rows)

         A   B       C
0   Ramesh  20     Hyd
1   Suresh  22  Mumbai
2  Sathish  24     Blr

🔴 यह ग़लत है:
python
Copy code
df.rename(d, inplace=True)
यह technically काम करता है, लेकिन ये साफ़ तरीका नहीं है क्योंकि:

इसमें आप positional argument दे रहे हो (यानि mapper को position से pass कर रहे हो),

Python/Pandas में हमेशा keyword argument (mapper=...) का उपयोग करना बेहतर होता है ताकि code साफ़ और समझने लायक हो।

In [ ]:
| Parameter            | मतलब                             | उपयोग                                |
| -------------------- | -------------------------------- | ------------------------------------ |
| `columns=`           | सिर्फ़ columns बदलने के लिए      | `df.rename(columns=d)`               |
| `index=`             | सिर्फ़ rows (index) बदलने के लिए | `df.rename(index={0: 'a', 1: 'b'})`  |
| `mapper=` + `axis=1` | columns को बदलने के लिए          | `df.rename(mapper=d, axis=1)`        |
| `mapper=` + `axis=0` | rows (index) को बदलने के लिए     | `df.rename(mapper={0: 'a'}, axis=0)` |

In [13]:
import pandas as pd

data = {
    'Names': ['Ramesh', 'Suresh', 'Sathish'],
    'Age': [20, 22, 24],
    'City': ['Hyd', 'Mumbai', 'Blr']
}

df = pd.DataFrame(data)

rename_dict = {'Names': 'A', 'Age': 'B', 'City': 'C'}

# साफ़ और सही तरीका:
df.rename(mapper=rename_dict, axis=1, inplace=True)

print(df)

         A   B       C
0   Ramesh  20     Hyd
1   Suresh  22  Mumbai
2  Sathish  24     Blr

## step -10 how to use new data frame

In [2]:
import pandas as pd

data = {
    'Names': ['Ramesh', 'Suresh', 'Sathish'],
    'Age': [20, 22, 24],
    'City': ['Hyd', 'Mumbai', 'Blr']
}

df = pd.DataFrame(data)
df['marks']=[100,200,300]# adding a new column
df['Age']=[50,60,70]# modify age
df

     Names  Age    City  marks
0   Ramesh   50     Hyd    100
1   Suresh   60  Mumbai    200
2  Sathish   70     Blr    300

## step-11 save the data frame
- if we want to read or write we need 3 values
    - where you want to save
    - on which name you want to save
    - on which format you want to save
- file name.txt
- filename.csv of filename.xlsx
- if i provide only file name it will save at cwd

In [4]:
df

     Names  Age    City  marks
0   Ramesh   50     Hyd    100
1   Suresh   60  Mumbai    200
2  Sathish   70     Blr    300

### step-12 read the data frame

In [24]:
pd.read_csv('data.csv')

     Names  Age    City  marks
0   Ramesh   50     Hyd    100
1   Suresh   60  Mumbai    200
2  Sathish   70     Blr    300

In [29]:
df.to_excel('data.xlsx',index=False)

In [30]:
pd.read_excel('data.xlsx')

     Names  Age    City  marks
0   Ramesh   50     Hyd    100
1   Suresh   60  Mumbai    200
2  Sathish   70     Blr    300

In [3]:
df.to_csv("data.csv",index=False)
df.to_csv(r"C:\Users\HP\Downloads\bank (1).csv")

In [21]:
pd.read_csv('data.csv')

     Names  Age    City  marks
0   Ramesh   50     Hyd    100
1   Suresh   60  Mumbai    200
2  Sathish   70     Blr    300

In [10]:
pd.read_csv(r"C:\Users\HP\Downloads\bank (2).csv",sep=';')

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

In [6]:
mp={'name':['manish','gagan','anil'],
   'age':[27,26,25],
   'city':['gwalior','davra','bhind'],
   'job':['no','yes','no']}
up=pd.DataFrame(mp)
up

     name  age     city  job
0  manish   27  gwalior   no
1   gagan   26    davra  yes
2    anil   25    bhind   no

In [19]:
up.to_csv('friend.csv',index=True)

In [20]:
up.to_csv('friend1.csv',index=False)

In [23]:
up.to_csv(r'D:\python data save\friends.csv')

In [22]:
pd.read_csv('friend1.csv')

     name  age     city  job
0  manish   27  gwalior   no
1   gagan   26    davra  yes
2    anil   25    bhind   no

In [24]:
up.to_excel('manish.xlsx',index=False)

In [25]:
pd.read_excel('manish.xlsx')

     name  age     city  job
0  manish   27  gwalior   no
1   gagan   26    davra  yes
2    anil   25    bhind   no

In [26]:
up.to_excel(f'D:\python data save\manish.xlsx')

In [27]:
pd.read_excel('manish.xlsx')

     name  age     city  job
0  manish   27  gwalior   no
1   gagan   26    davra  yes
2    anil   25    bhind   no